#+TITLE: Variables in org-mode
#+DESCRIPTION: 
#+AUTHOR: cissic
#+DATE: <2023-10-23 Mon>
#+TAGS: kde kde-activity windows-manager
# #+OPTIONS: toc:nil
#+OPTIONS: -:nil

#+BIND: org-babel-inline-result-wrap: "%s%"

* TODO {{{title}}}
:PROPERTIES:
:PRJ-DIR: ./2023-10-23-variables-in-org/
:END:

** How to insert variables into org document


#+begin_src elisp :exports results
  ;; Pomocnicza hash-tablica z polskimi miesiacami do generowania dat
  (setq day_number (format-time-string "%e"))
  ;;(print (substring day_number 0 1))
  ;;(print (string-trim day_number))
  (setq day_number (string-trim day_number))
  (setq dzien_tygodnia (format-time-string "%u"))

  (setq month_number (format-time-string "%m"))
  (setq year_number (format-time-string "%Y"))
  ;; (print month)

  (setq miesiace
	#s(hash-table
	   size 12
	   test equal
	   data (
		 "01" "stycznia"
		 "02" "lutego"
		 "03" "marca"
		 "04" "kwietnia"
		 "05" "maja"
		 "06" "czerwca"
		 "07" "lipca"
		 "08" "sierpnia"
		 "09" "września"
		 "10" "października"
		 "11" "listopada"
		 "12" "grudnia"		 
		 )))

  (setq dni
	#s(hash-table
	   size 12
	   test equal
	   data (
		 "1" "poniedziałek"
		 "2" "wtorek"
		 "3" "środa"
		 "4" "czwartek"
		 "5" "piątek"
		 "6" "sobota"
		 "7" "niedziela"	 
		 )))

  ;; (print (gethash "02" miesiace))
  ;; (print (gethash month_number miesiace))
  (setq month_word (gethash month_number miesiace))
  (setq dzien_tygodnia_slownie (gethash dzien_tygodnia dni))

  (defun wstaw-date-z-dniem-tygodnia ()
    (interactive)
    (concat day_number " " month_word " "  year_number " r." " (" dzien_tygodnia_slownie ")" )
  )

  (defun wstaw-date ()
    (interactive)
    (concat day_number " " month_word " "  year_number " r." )
  )

  (print dzien_tygodnia)
  (wstaw-date-z-dniem-tygodnia)
  (wstaw-date)
#+end_src

#+RESULTS:
: 23 października 2023 r.


*src_elisp[:results raw :exports both]{(wstaw-date-z-dniem-tygodnia)}*






* COMMENT Local Variables

# Local Variables:
# eval: (setq org-latex-pdf-process
#  '("pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"
#    "pdflatex -shell-escape -synctex=1 -interaction=nonstopmode -output-directory %o %f"))
# End:
 

# # org-babel-inline-result-wrap: "%s%"
